import Head from "next/head";
import Image from "next/image";
import { useRouter } from "next/router";
import styles from "./Content.module.scss";

export default function Content() {
  const router = useRouter();
  const Classes = {
    contentContainer: styles.contentContainer,
    category: styles.category,
    title: styles.title,
    content: styles.content,
    apps: styles.apps,
    categories: styles.categories,
    footer: styles.footer,
  };
  return (
    <>
      <div className={Classes.contentContainer}>
        <span className={Classes.category}>ما هو أرادكت ؟</span>
        <p className={Classes.title}>
          لاستخدام قاموس Aradict.com ، يرجى كتابة كلمتك في القسم أعلاه
        </p>
        <div className={Classes.content}>
          هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
          النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من
          النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت
          تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد
          الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص
          العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من
          الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على المصمم
          أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص
          العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع
          الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه
          على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو
          حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.
          <br />
          <img
            style={{
              margin: "0 auto",
              display: "block",
              padding: "15px",
              width: "100%",
              height: "auto",
              maxWidth: "500px",
            }}
            src="Dictionary.jpg"
          />
          <br /> هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم
          توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو
          العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
          التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص
          العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء
          لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج
          العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن
          هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل
          كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل
          لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا
          النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص
          منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً
          ومؤقتاً. هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم
          توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو
          العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
          التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص
          العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء
          لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج
          العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن
          هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل
          كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل
          لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا
          النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص
          منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً
          ومؤقتاً.
          <br />
          <img
            style={{
              margin: "0 auto",
              display: "block",
              padding: "15px",
              width: "100%",
              height: "auto",
              maxWidth: "500px",
            }}
            src="Dictionary.jpg"
          />
          <br /> هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم
          توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو
          العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
          التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص
          العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء
          لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج
          العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن
          هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل
          كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل
          لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا
          النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص
          منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً
          ومؤقتاً. هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم
          توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو
          العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
          التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص
          العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء
          لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج
          العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن
          هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل
          كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل
          لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا
          النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص
          منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً
          ومؤقتاً.
          <br />
          <img
            style={{
              margin: "0 auto",
              display: "block",
              padding: "15px",
              width: "100%",
              maxWidth: "500px",
              height: "auto",
            }}
            src="Dictionary.jpg"
          />
          <br /> هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم
          توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو
          العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
          التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص
          العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء
          لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج
          العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن
          هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل
          كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل
          لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا
          النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص
          منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً
          ومؤقتاً.
        </div>
      </div>
    </>
  );
}
